# ── Core CLI Tools ────────────────────────────────────────────────────────────
# tag:core
brew "bash"                    # Latest bash (macOS ships 3.x)
brew "git"                     # Latest git
brew "tmux"                    # Terminal multiplexer
brew "ripgrep"                 # Fast search (rg)
brew "fd"                      # Fast find
brew "bat"                     # Better cat
brew "eza"                     # Better ls
brew "fzf"                     # Fuzzy finder
brew "jq"                      # JSON processor
brew "tree"                    # Directory tree
brew "htop"                    # Process viewer
brew "wget"                    # HTTP client
brew "curl"                    # HTTP client (latest)
brew "coreutils"               # GNU core utilities

# ── Development Tools ─────────────────────────────────────────────────────────
# tag:dev
brew "gh"                      # GitHub CLI
brew "lazygit"                 # Terminal UI for git
brew "bob"                     # Neovim version manager
brew "chezmoi"                 # Dotfile manager
brew "direnv"                  # Per-directory env vars
brew "act"                     # Run GitHub Actions locally
brew "shellcheck"              # Shell script linter

# ── Languages & Runtimes ─────────────────────────────────────────────────────
# tag:languages
# brew "n"                     # Node version manager (or install via curl)
# brew "python"                # Python 3
# brew "go"                    # Go language
# brew "rustup"                # Rust toolchain manager

# ── Fonts ─────────────────────────────────────────────────────────────────────
# tag:fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# ── macOS Apps ────────────────────────────────────────────────────────────────
# tag:apps
# cask "iterm2"                # Terminal emulator
# cask "docker"                # Docker Desktop
# cask "rectangle"             # Window management
# cask "raycast"               # Spotlight replacement

# ── Fun / Niche Tools ────────────────────────────────────────────────────────
# tag:fun
brew "fastfetch"               # System info display
brew "btop"                    # Beautiful system monitor
brew "lolcat"                  # Rainbow terminal output
brew "cowsay"                  # ASCII art cow messages
brew "fortune"                 # Random fortune quotes
brew "figlet"                  # ASCII art text
brew "pipes-sh"                # Animated pipes screensaver
brew "cmatrix"                 # Matrix rain in terminal
